---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.FlowState
source: html/ce2a3a55-ea44-ceb8-63e9-1a848f4362d4.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.FlowState Property

The calculated flow state of this segment.

## Syntax (C#)
```csharp
public PipeFlowState FlowState { get; }
```